# Gpm Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..Gpm Property
SymbolTypeId Class See Also
---
Symbol GPM, indicating unit US gallons per minute.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId Gpm { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Gpm As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Gpm {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace